alert('Тест: чи добре ви знаєте українську політику. За кожну правильну відповідь ви отримаєте 1 бал. В якості відповіді вводьте тільки прізвище. Якщо здастеся, натисните "Відмінити". Поїхали!');

count=0;
let ask1 = prompt('Хто найвідоміший бджоляр України?')
	
	if (ask1.toLowerCase() =='ющенко') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask1=='') {
				ask1 = prompt('Ну подумайте ще!');
				if (ask1.toLowerCase()=='ющенко') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask2 = prompt('Хто перший космонавт в Верховній Раді?')
	if(ask2.toLowerCase()=='черновецький') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask2=='') {
				ask2 = prompt('Ну подумайте ще!');
				if (ask2.toLowerCase()=='черновецький') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask3 = prompt('Хто першим публічно заявив, що наші політики кривосісі?')
	if(ask3.toLowerCase()=='азаров') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask3=='') {
				ask3 = prompt('Ну подумайте ще!');
				if (ask3.toLowerCase()=='азаров') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask4 = prompt('Кому шоколадка дорожче Батьківщини?')
	if(ask4.toLowerCase()=='порошенко') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask4=='') {
				ask4 = prompt('Ну подумайте ще!');
				if (ask4.toLowerCase()=='порошенко') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask5 = prompt('Хто з закордонних президентів намагався стати українським Карлсоном?')
	if(ask5.toLowerCase()=='саакашвілі') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask5=='') {
				ask5 = prompt('Ну подумайте ще!');
				if (ask5.toLowerCase()=='саакашвілі') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask6 = prompt('Хто накрав 114 мільойнів доларів і звалив в Америку? Підказка: на честь його однофамільця названа одна з вулиць біля Податкової.')
	if(ask6.toLowerCase()=='лазаренко') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask6=='') {
				ask6 = prompt('Ну подумайте ще!');
				if (ask6.toLowerCase()=='лазаренко') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask7 = prompt('Якого президента наші футбольні фанати найчастіше згадують в своїх піснях?')
	if(ask7.toLowerCase()=='путін') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask7=='') {
				ask7 = prompt('Ну подумайте ще!');
				if (ask7.toLowerCase()=='путін') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask8 = prompt('Якого президента намагалися застрелити яйцями і прибити вінком?')
	if(ask8.toLowerCase()=='янукович') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask8=='') {
				ask8 = prompt('Ну подумайте ще!');
				if (ask8.toLowerCase()=='янукович') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask9 = prompt('Хто недавно співав з холодильника, а тепер хоче в президенти?')
	if(ask9.toLowerCase()=='вакарчук') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask9=='') {
				ask9 = prompt('Ну подумайте ще!');
				if (ask9.toLowerCase()=='вакарчук') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

let ask10 = prompt('Хто своїми виразами і роздумами вголос відправляє нас в інтелектуальний нокаут?')
	if(ask10.toLowerCase()=='кличко') {
		alert('Вірно! +1 бал');
		count++;
	}
	else if (ask10=='') {
				ask10 = prompt('Ну подумайте ще!');
				if (ask10.toLowerCase()=='кличко') {
					alert('Вірно! +1 бал');
					count++;
				}
			
				else {
					alert('Не знаєте. 0 балів.');
				}
		}
	else {
		alert('Неправильна відповідь.');
	}

if (count<2) {
	alert('Ви набрали ' + count + ' балів. Ви зовсім не розбираєтеся в політиці. Напевне вам краще дається IT)');
	}
	else if (count<6) {
		alert('Ви набрали ' + count + ' балів. Не дуже з вас політолог, але, певно, хороший IT-шник)');
	}
	else if (count<9) {
		alert('Ви набрали ' + count + ' балів. Вітаємо! Ви добре розбираєтеся в політиці. А в IT - ще краще)');
	}
	else {
		alert('Браво! 10 з 10! З вас би вийшов гарний політолог, але IT-шник - ще кращий)');
	}
