/*Завдання 1: Користувач вводить по черзі  5 чисел через prompt. 
Знайти кількість від’ємних чисел і вивести результат через alert.*/

let i = 0;
let num;
let neg = 0;
const FIVE = 5;
const ZERO = 0;
do {
  num = +prompt('Введіть число');
  i++;
  if (num < ZERO) {
    neg++;
  }
}
while (i < FIVE);
alert(neg);

/*Завдання 2: Зробити запит у користувача , скільки зірочок він хоче побачити на сторінці 
і в якому розташуванні він їх хоче побачити : горизонтальному або вертикальному . 
Необхідно створити нову змінну і запроси¬ти у користувача ще одні дані: 
нехай 1 - це горизонтальна лінія з зірочок , а 2 - це вертикальна . */

let sum = +prompt('Скільки зірочок и хочете бачити на сторінці?');
let dir = prompt(
  'Вивести в горизонтальному(1) чи вертикальному направленні(2)?');
let star = '*';
const ZERO = 0;
do {
  if (dir === '1') {
    document.write(star);
    sum--;
  } else if (dir === '2') {
    document.write(star + '<br>');
    sum--;
  } else {
    alert('none');
  }
} while (sum > ZERO);

/*Завдання 3: Необхідно виводити зірочки , поки користувач не зупинить цей процес. 
Відповідно, після виведення кожної зірочки питати у користувача чи хоче він ще . */

let more = confirm('Press OK if you want star!');
while (more === true) {
  alert('*');
  let more = confirm('Press OK if you want more stars!');
  if (more === false) {
    break;
  }
}

/*Завдання 4: Користувач вводить числа по черзі до тих пір,
 поки не буде введене від’ємне число. 
Потрібно обрахувати кількість чисел, які були введені до моменту зупинки циклу*/

let i = 0;
let num;
const ZERO = 0;
const ONE = 1;
do {
  num = +prompt('Введіть число');
  i++;
}
while (num > ZERO);
alert(i - ONE);